DataProcessors/УЗ_НормализацияАдресов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УЗ_НормализацияАдресов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитХраненияАдреса</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КредитныеИсторииВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисНормализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьСтруктуруАдресаКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатПочтаРФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДляНормализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраныОКСМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаселенныйПункт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Микрорайон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Корпус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Строение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Литера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дробь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеПараметрыСервиса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УЗ_НормализацияАдресов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗапуститьНормализациюНаСервере()  
	Если Объект.Объекты.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нужно выбрать хотя бы один объект для  нормализации!"; 
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;    
	
	
	
	ТаблицаПодготовкаДанных = Обработки.УЗ_НормализацияАдресов.ВернутьДанныеДляНормализацииПоОбъектам(Объект.Объекты.Выгрузить().ВыгрузитьКолонку("Объект"), Объект.РеквизитХраненияАдреса);
	
	Если Объект.СервисНормализации = "ПочтаРФ" Тогда 
		Объект.РезультатПочтаРФ.Загрузить(ТаблицаПодготовкаДанных);
		Для Каждого стр Из Объект.РезультатПочтаРФ Цикл   
			стрИдентификатор = ?(ЗначениеЗаполнено(стр.КодДО), стр.КодДО, стр.КодКонтрагента);
			стр.ИдентификаторЗапроса = МодульНормализацияПочтаРФ.ВернутьИдентификаторЗапроса(стрИдентификатор);
		КонецЦикла;
		мТелоЗапроса = МодульНормализацияПочтаРФ.СформироватьМассивАдресовНормализация(Объект.РезультатПочтаРФ.Выгрузить(, "ИдентификаторЗапроса, АдресДляНормализации"));
		JSРезультатНормализацииПочтаРФ = МодульНормализацияПочтаРФ.ГлавнаяНормализоватьАдресаПочтаРФ(мТелоЗапроса);
		тзОбъединение = Объект.РезультатПочтаРФ.Выгрузить();  
		тзОбъединение.Индексы.Добавить("ИдентификаторЗапроса");
		МодульНормализацияПочтаРФ.ЗаполнитьПользовательскуюТаблицуРезультатов(тзОбъединение, JSРезультатНормализацииПочтаРФ);
		Объект.РезультатПочтаРФ.Загрузить(тзОбъединение);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция завершена";
		Сообщение.Сообщить();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНормализацию(Команда)
	ЗапуститьНормализациюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда) 
	Если Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор;
	ИначеЕсли Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаЗапускИРезультаты Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис;  
	Иначе
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда) 
	Если Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис;
	ИначеЕсли Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаСервис Тогда
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаЗапускИРезультаты;
	Иначе
		Элементы.ГруппаШагиНормализации.ТекущаяСтраница = Элементы.ГруппаПодбор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	Объект.Объекты.Очистить();
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	Объект.Объекты.Очистить();
	ФормаПодбор = ПолучитьФорму("Обработка.ПодборДО.Форма.Форма",, ЭтаФорма); 
	ФормаПодбор.Объект.ТипИсточника = Неопределено;
	ОткрытьФорму(ФормаПодбор); 
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	Объект.Объекты.Очистить();
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКИСтруктураАдреса(Команда)  
	
	Если НЕ ЗначениеЗаполнено(Объект.АдресКИ) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нужно выбрать адрес КИ!"; 
		Сообщение.Поле = "Объект.АдресКИ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	ТекстУведомления = "";
	ПараметрыЗапуска = Новый Структура();	
	СтруктураФоновогоЗадания  = ВыполнитьФоновоеЗаданиеЗаписатьКИСтруктураАдресаНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);     
	
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал 	= 2;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьРезультатЗаписиКИСтруктураАдреса", ЭтотОбъект), ПараметрыОжидания); 
КонецПроцедуры    

&НаКлиенте
Процедура ОбработатьРезультатЗаписиКИСтруктураАдреса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выполнено!";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Статус задачи неопределен!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ВыполнитьФоновоеЗаданиеЗаписатьКИСтруктураАдресаНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	НаименованиеЗадания = "ЗаписатьКИСтруктураАдресаНаСервере";

	ВыполняемыйМетод = "КредитныеИстории.ЗаполнитьСтруктуруАдресаИзНормализации";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
	ПараметрыЗапуска = ОпределитьПараметрыЗапуска(ПараметрыЗапуска);
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;

КонецФункции  

&НаСервере
Функция ОпределитьПараметрыЗапуска(ПараметрыЗапуска) 
	Если Объект.СервисНормализации = "ПочтаРФ" Тогда
		ТаблицаРезультат = Объект.РезультатПочтаРФ.Выгрузить();
	Иначе
		ТаблицаРезультат = Неопределено;
	КонецЕсли;  
	
	МассивТаблица = УдалитьОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультат);		
	ПараметрыЗапуска.Вставить("МасстзДанныеНомализации", МассивТаблица);
	ПараметрыЗапуска.Вставить("ВидАдреса", Объект.АдресКИ); 
	ПараметрыЗапуска.Вставить("Перезаписывать", Объект.ПерезаписыватьСтруктуруАдресаКИ);
	Возврат ПараметрыЗапуска;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.СервисНормализации = "ПочтаРФ"; 
	Элементы.ДекорацияПочтаРФ.Видимость = (Объект.СервисНормализации = "ПочтаРФ");
КонецПроцедуры

&НаКлиенте
Процедура СервисНормализацииПриИзменении(Элемент)
	Элементы.ДекорацияПочтаРФ.Видимость = (Объект.СервисНормализации = "ПочтаРФ");
КонецПроцедуры
